app/Controllers/User.php

SELECT *
FROM `orders`
WHERE `user_id` = '3'
ORDER BY `created_at` DESC
---
    public function profile()
    {
        $session = session();
        if (!$session->has('user')) {
            return redirect()->to('login');
        }

        $user = $session->get('user');

        // Initialize addresses list in user session if it doesn't exist
        if (!isset($user['addresses'])) {
            $user['addresses'] = [];
            // If the user has a registration address, use it as 'Principal'
            if (isset($user['address'])) {
                $user['addresses'][] = [
                    'alias' => 'Principal',
                    'address' => $user['address']
                ];
            }
            // Update session so it's persisted
            $session->set('user', $user);
        }

        // Fetch orders from DB
        $orderModel = new \App\Models\OrderModel();
        $orderItemModel = new \App\Models\OrderItemModel();

        $userId = $user['id'] ?? 0;
        $dbOrders = $orderModel->where('user_id', $userId)->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `order_items`
WHERE `order_id` = '6'
---
        $orders = [];
        foreach ($dbOrders as $o) {
            // Get items
            $items = $orderItemModel->where('order_id', $o['id'])->findAll();

SELECT *
FROM `users`
WHERE `email` = 'admin@admi.c'
 LIMIT 1
INSERT INTO `users` (`name`, `email`, `password_hash`, `phone`, `address`, `created_at`, `updated_at`) VALUES ('jin', 'admin@admi.c', '$2y$10$x5HwxyJANPYSDcHiXU2KW.G1AMxitlM9Im38075Xi3Jw4p.Mrczb.', '04126980234', 'https://www.google.com/maps?q=10.6092993,-66.8508968&z=17&hl=es', '2026-02-08 12:37:50', '2026-02-08 12:37:50')
---
    public function create()
    {
        $userModel = new \App\Models\UserModel();

        $username = $this->request->getPost('username');
        $data = [
            'name' => $this->request->getPost('name'),
            'email' => $username,
            'password_hash' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'phone' => $this->request->getPost('phone'),
            'address' => $this->request->getPost('address'),
        ];

        // Basic validation check
        if ($userModel->where('email', $username)->first()) {
             return redirect()->back()->with('error', 'El nombre de usuario ya está en uso.');
        }

        $userModel->save($data);

        // Auto login
        $user = $userModel->where('email', $username)->first();

SELECT *
FROM `users`
WHERE `email` = 'admin@admi.com'
 LIMIT 1
---
    public function attempt_login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('email', $username)->first();